# นักซิ่ง
# ณ ถนนเส้นหนึ่งในประเทศไทย มีรถนักซิ่งขับอยู่บนถนน 2 คัน คนแรกขับรถสปอร์ตหรูสีแดง ชื่อว่าเล็ก คนที่สองขับรถบรรทุกแต่งซิ่งควันดำ ชื่อว่าใหญ่ โดยเล็กขับรถด้วยความเร็ว A กม./ชม. และใหญ่ขับรถด้วยความเร็ว B กม./ชม. โดยที่ใหญ่จะขับรถเร็วกว่าเล็กเสมอ (B>A)

# ทั้ง 2 คนขับรถออกจากปั้มน้ำมันพร้อมกัน จงหาว่าเมื่อใหญ่ขับรถไปได้ระยะทาง X กม.แล้วหยุดรถรอเล็ก จะต้องรอเล็กกี่วินาที เล็กถึงจะตามมาทัน

# รับประกันว่า X หารด้วย A และ B ลงตัว

a = float(input("A : "))*(5/18)
b = float(input("B : "))*(5/18)
x = float(input("X : "))*1000
print(f"Wait : {round(((1-(a/b))*x)/a)} sec")